Revit 2027 API
NonContinuousRailStructure.GetNonContinuousRailCount Method
 Gets number of Non-Continuous Rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNonContinuousRailCount()
Public Function GetNonContinuousRailCount As Integer
public:
int GetNonContinuousRailCount()
member GetNonContinuousRailCount : unit -> int
Return Value
Int32
 Count of Non-Continuous Rails.
See Also
Reference
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace